{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "2.11.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "life_expectancy_model",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [null, 8],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {"seed": null}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "dense_1"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "units": 32,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {"seed": null}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "dense_2"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "units": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {"seed": null}
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "name": "output"
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "mse",
            "metrics": ["mae"],
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "learning_rate": 0.001,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-7
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": ["model.weights.bin"],
            "weights": [
                {
                    "name": "dense_1/kernel",
                    "shape": [8, 64],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias", 
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/kernel",
                    "shape": [64, 32],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/bias",
                    "shape": [32], 
                    "dtype": "float32"
                },
                {
                    "name": "output/kernel",
                    "shape": [32, 1],
                    "dtype": "float32"
                },
                {
                    "name": "output/bias",
                    "shape": [1],
                    "dtype": "float32"
                }
            ]
        }
    ]
}